/* ************************************************************************** */
/*                                                                            */
/*                                                      :::    :::    :::     */
/*   Problem Number: 30876                             :+:    :+:      :+:    */
/*                                                    +:+    +:+        +:+   */
/*   By: jack0969 <boj.kr/u/jack0969>                +#+    +#+          +#+  */
/*                                                  +#+      +#+        +#+   */
/*   https://boj.kr/30876                          #+#        #+#      #+#    */
/*   Solved: 2025/09/10 00:41:17 by jack0969      ###          ###   ##.kr    */
/*                                                                            */
/* ************************************************************************** */
// N개의 역, N-1개의 철로
// i번째 역은 (xi, yi) 좌표에 위치
// j번째 철로는 j번 역과 j+1 역 사이를 잇는 선분
// 세상에서 가장 남쪽에 있는 철도가 지나는 가장 남쪽 점 ?

#include <iostream>
using namespace std;

int main() {
    int N;
    cin >> N;
    int min_x, min_y;
    for (int i = 0; i < N; ++i) {
        int x, y;
        cin >> x >> y;
        if (i == 0 || y < min_y || (y == min_y && x < min_x)) {
            min_x = x;
            min_y = y;
        }
    }
    cout << min_x << " " << min_y << endl;
    return 0;
}